---
kind: property
id: P:Autodesk.Revit.DB.ExtrusionAnalyzer.EndParameter
source: html/bebcd422-84f8-2086-d130-ef04abab4d64.htm
---
# Autodesk.Revit.DB.ExtrusionAnalyzer.EndParameter Property

The end parameter (distance along the extrusion direction from the input plane) calculated by the extrusion analysis.

## Syntax (C#)
```csharp
public double EndParameter { get; }
```